{
  "backend/main.mo": "Defines a Motoko actor that stores contact inquiries in a map and exposes submit and query endpoints.",
  "feature_evidence.json": "Contains feature evidence metadata listing updated files, components, and test IDs for two product and cart-related features.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of all major frontend files for reference or build tooling.",
  "frontend/index.css": "Tailwind base setup defining OKLCH color tokens and global light/dark theme variables.",
  "frontend/index.html": "HTML entry point mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up theme provider, router configuration, shared layout, and routes for landing and inquiries pages.",
  "frontend/src/components/cart/CartSheet.tsx": "Implements a cart drawer UI with quantity controls, item removal, totals, and empty state handling.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders an about section with highlight cards and descriptive studio information.",
  "frontend/src/components/sections/CatalogSection.tsx": "Displays the products list with pricing and supports adding items to the cart with toast feedback.",
  "frontend/src/components/sections/ContactSection.tsx": "Provides a contact form with validation, backend submission, and a temporary success message state.",
  "frontend/src/components/sections/HeroSection.tsx": "Landing hero block with background image, headline, and buttons that smooth-scroll to contact and portfolio sections.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Displays a grid of portfolio items with audio previews using cards and static sample metadata.",
  "frontend/src/components/sections/ServicesSection.tsx": "Renders a services overview grid with icons and brief descriptions of offered audio services.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer with company info, contact details, social links, and a dynamic year plus caffeine.ai attribution.",
  "frontend/src/components/site/SiteHeader.tsx": "Sticky header with logo, navigation links that smooth-scroll to sections, mobile sheet menu, and cart access.",
  "frontend/src/data/products.ts": "Defines the Product interface and exports a small list of store products with optional pricing.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useCart.ts": "Zustand store for cart items with add, remove, quantity update, totals, and persisted state.",
  "frontend/src/hooks/useInquiries.ts": "React Query hook that fetches inquiries from the backend actor once available.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, identity loading, and AuthClient management.",
  "frontend/src/hooks/useSubmitContact.ts": "Provides a React Query mutation hook to validate and submit contact form data via an actor and show toast notifications.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes with typography and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider and renders the main App component.",
  "frontend/src/pages/InquiriesPage.tsx": "Displays submitted contact inquiries with loading, error, empty, and table views using UI components.",
  "frontend/src/pages/LandingPage.tsx": "Renders the main landing page composed of multiple content sections such as hero, services, catalog, portfolio, about, and contact.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theme extensions, color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project state, existing features, and requirements for building an audio business website with product showcase and contact features."
}